/*****************************************************************
* ВЕРСИЯ:
*     $Id: 9d3b7e042c08c51593d082976ab96d9110914c69 $
*
******************************************************************
* НАЗНАЧЕНИЕ:
*     Выполняет откат опций после авоста для возможного продолжения работы
*
* ПАРАМЕТРЫ:
*     нет
*
******************************************************************
* Использует:
*     нет
*
******************************************************************
* Пример использования:
  ... потенциально сбойный шаг
  %error_recovery;
  ... продолжаем работу
*
******************************************************************
* 18-01-2012   Нестерёнок  Начальное кодирование
* 31-08-2012   Нестерёнок  Рефактор mpMode
******************************************************************/

%macro error_recovery;
   %if &SYSPROCNAME eq SQL %then %do;
      reset exec;
   %end;
   options nosyntaxcheck nodmssynchk replace obs=MAX;
%mend error_recovery;
