/*****************************************************************
*  ВЕРСИЯ:
*     $Id: b1cb81705afe784b3a28a4ed3461dca74a718ba4 $
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Возвращает имя папки из полного пути.
*     Если в переданном имени нет папок, возвращается пустая строка.
*     Разделитель папок в значение не включается.
*
*  ПАРАМЕТРЫ:
*     mpFullPath              +  полное имя файла
*
******************************************************************
*  Использует:
*     нет
*
*  Устанавливает макропеременные:
*     нет
*
******************************************************************
*  Пример использования:
*     %put Log is located in folder: %file_folder (mpFullPath=%log_location);
*
******************************************************************
*  18-06-2015  Нестерёнок     Начальное кодирование
******************************************************************/

%macro file_folder (
   mpFullPath=
);
   %local lmvLastSlash;
   %let lmvLastSlash = %sysfunc(findc(%superq(mpFullPath), %str(/\), B));
   %if &lmvLastSlash = 0 %then %return;
   %do;%substr(%superq(mpFullPath), 1, %eval(&lmvLastSlash - 1))%end;
%mend file_folder;