/*****************************************************************
*  ВЕРСИЯ:
*     $Id: 09e59f50b4e6975c824fcb4bb5d6118466c9c860 $
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Проверяет на пустоту значение макропеременной.
*
*  ПАРАМЕТРЫ:
*     mpValue                 +  имя макропеременной
*
******************************************************************
*  Использует:
*     нет
*
*  Устанавливает макропеременные:
*     нет
*
*  Ограничения:
*     нет
*
******************************************************************
*  Пример использования:
*     %let mvVar = ...;
*     %if %is_blank(mvVar) %then ...;
*
******************************************************************
*  02-10-2014  Нестерёнок     Начальное заимствование
******************************************************************/

%macro is_blank (mpValue);
%sysevalf(%superq(&mpValue)=,boolean)
%mend is_blank;
