/*****************************************************************
*  ВЕРСИЯ:
*     
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Удаляет все таблицы из заданной библиотеки.
*
*  ПАРАМЕТРЫ:
*     mpLib       	+ LIBNAME библиотеки
*
******************************************************************
*  Использует:
*	  
*  Устанавливает макропеременные:
*
*  Ограничения:
*
******************************************************************
*  Пример использования:
*
*  %lib_kill(mpLib=WORK);
*
******************************************************************
*  25-01-2016   Колосов        Начальное кодирование
******************************************************************/

%macro lib_kill(mpLib=WORK);
	proc datasets lib=&mpLib kill nolist;
	quit;
%mend lib_kill;