/*****************************************************************
*  ВЕРСИЯ:
*     $Id: 0cc9254736c1c026dd36165a10714e995e3c0f8c $
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Макрос для снятия блокировки
*
*  ПАРАМЕТРЫ:
*     mpLib                +  библиотека содержащая ресурс для блокировки 
*                             должна быть доступна всем процессам работающим с критической секцией
*     mpLockNm             +  название блокировки
*                             По умолчанию lck
*
******************************************************************
*  Использует:
*     
*
*  Устанавливает макропеременные:
*     нет
*
******************************************************************
*  Пример использования:
*     %lock_get(work_dq);
*       ...
*     %lock_release(work_dq);  
*
****************************************************************************
*  28-04-2017  Сазонов     Начальное кодирование
****************************************************************************/
%macro lock_release(mpLib,mpLockNm=lck);
    %local lmvLockTab;
    %let lmvLockTab=&mpLib..&mpLockNm._lck;
    lock &lmvLockTab clear nomsg;
    %member_drop(&lmvLockTab)
%mend lock_release;
