/*****************************************************************
*  ВЕРСИЯ:
*     $Id: 4fd71b217571e1d0e148892685bb0bb81794f9aa $
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Возвращает имя файла, в который выводится лог.
*
*  ПАРАМЕТРЫ:
*     нет
*
******************************************************************
*  Использует:
*     нет
*
*  Устанавливает макропеременные:
*     нет
*
*  Ограничения:
*     1.  Работает только вне контекста серверных сессий (WSS, SPS), для которых возвращает пустую строку.
*
******************************************************************
*  ПРИМЕР ИСПОЛЬЗОВАНИЯ:
*     %put Log is located in folder: %file_folder (mpFileName=%log_location);
*
******************************************************************
*  18-06-2015  Нестерёнок     Начальное кодирование
******************************************************************/

%macro log_location;
   %local lmvLogPath;
   %let lmvLogPath = %sysfunc(getoption(altlog));
   %if %is_blank(lmvLogPath) and %sysfunc(getoption(objectserver)) = NOOBJECTSERVER %then %do;
      %let lmvLogPath = %sysfunc(getoption(log));
   %end;
   %do;&lmvLogPath%end;
%mend log_location;
