/*****************************************************************
*  ВЕРСИЯ:
*     $Id: 90e5032a4e1982107a36816e1916055545734377 $
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Возвращает случайное целое значение из интервала.
*
*  ПАРАМЕТРЫ:
*     mpMin                   +  начало интервала
*     mpMax                   +  конец интервала
*
******************************************************************
*  Использует:
*     нет
*
*  Устанавливает макропеременные:
*     нет
*
*  Ограничения:
*     нет
*
******************************************************************
*  Пример использования:
*     %let mvVar = %rand_between(200,300)
*
******************************************************************
*  13-09-2017  Сазонов     Начальное кодирование
******************************************************************/

%macro rand_between(
   mpMin,
   mpMax
);
   %sysevalf(&mpMin + %sysfunc(floor((1+&mpMax-&mpMin)*%sysfunc(rand(uniform)))))
%mend rand_between;
