/*****************************************************************
*  ВЕРСИЯ:
*     $Id: ed70409f2308bec1817700544644c88085416a47 $
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Регистрирует конец модуля STP.
*
*  ПАРАМЕТРЫ:
*     нет
*
******************************************************************
*  Использует:
*     %job_continue
*     %job_finish
*
*  Устанавливает макропеременные:
*     нет
*
******************************************************************
*  Пример использования:
*     В трансформации transform_job_finish.sas
*
******************************************************************
*  22-02-2017  Хорошко     Начальное кодирование
******************************************************************/

%macro stp_job_finish;
   /* Продолжаем модуль */
   %job_continue(mpJobType=JOB, mpPostEvent=N);
	
   /* Завершаем модуль */
   %job_finish(mpJobType=JOB);
%mend stp_job_finish;
