/*****************************************************************
* ВЕРСИЯ:
*   $Id: 4be75370f85d6fd057592555729e23a33181bf2c $
*
******************************************************************
* НАЗНАЧЕНИЕ:
*   Добавляет двойные кавычки вокруг переданного значения.
*   Типовое использование - совместно с util_loop.
*
* ПАРАМЕТРЫ:
*   mpValue          +  значение, которое требуется закавычить
*
******************************************************************
* ИСПОЛЬЗУЕТ:
*     нет
*
* УСТАНАВЛИВАЕТ МАКРОПЕРЕМЕННЫЕ:
*     нет
*
******************************************************************
* ПРИМЕР ИСПОЛЬЗОВАНИЯ:
*    %let my_list = A B C;
*    data aaa;
*        set bbb;
*        where value in (%util_loop(mpMacroName=util_quote, mpWith=&my_list));
*        ...
*
******************************************************************
* 27-12-2011   Нестерёнок  Начальное кодирование
******************************************************************/

%macro util_quote(mpValue);
   %do;
      %sysfunc(quote(&mpValue))
   %end;
%mend util_quote;
