/*****************************************************************
*  ВЕРСИЯ:
*     $Id: 9ef59f32a9b22c81e60c53085629e90ac17bba28 $
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Регистрирует начало потока ETL.
*
*  ПАРАМЕТРЫ:
*     нет
*
******************************************************************
*  Использует:
*     %etl_stream_name
*     %job_start
*
*  Устанавливает макропеременные:
*     нет
*
******************************************************************
*  Пример использования:
*     %etl_stream_start;
*
******************************************************************
*  22-12-2014  Нестерёнок     Вынесено из трансформации transform_stream_start.sas
******************************************************************/

%macro etl_stream_start;
   /* Начинаем поток */
   %local lmvStreamName lmvStreamType;
   %etl_stream_name (mpOutNameKey=lmvStreamName, mpOutContextKey=lmvStreamType);

   %job_start(mpJobType=STREAM, mpParentJobId=, mpJobName=&lmvStreamName.);
%mend etl_stream_start;
