/*****************************************************************
*  ВЕРСИЯ:
*     $Id: 9006240aa447922790cf793089a7f1648493e403 $
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Возвращает 1, если уровень протоколирования 1 больше или равен уровня 2,
*     или 0 в любом другом случае.
*
*  ПАРАМЕТРЫ:
*     mpLevel1             +  уровень протоколирования 1
*     mpLevel2             +  уровень протоколирования 2
*
******************************************************************
*  Использует:
*     нет
*
*  Устанавливает макропеременные:
*     нет
*
******************************************************************
*  Пример использования:
*     %if %etl_level_ge (mpLevel1=&myLevel, mpLevel2=W) %then %do...
*
******************************************************************
*  30-05-2014  Нестерёнок     Начальное кодирование
******************************************************************/

%macro etl_level_ge (mpLevel1=, mpLevel2=);
   %if (%is_blank(mpLevel1)) or (%is_blank(mpLevel2)) %then %do;
      0
      %return;
   %end;
   %do;
      %eval ( %sysfunc(inputn(&mpLevel1, lvl_cd_wgt.)) ge %sysfunc(inputn(&mpLevel2, lvl_cd_wgt.)) )
   %end;
%mend etl_level_ge;
