/*****************************************************************
*  ВЕРСИЯ:
*     $Id: bf50dbcf716800578ceef90ebbea8393020e1aee $
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Регистрирует конец модуля ETL.
*
*  ПАРАМЕТРЫ:
*     нет
*
******************************************************************
*  Использует:
*     %job_continue
*     %job_finish
*
*  Устанавливает макропеременные:
*     нет
*
******************************************************************
*  Пример использования:
*     В трансформации transform_job_finish.sas
*
******************************************************************
*  19-06-2015  Нестерёнок     Выделен из transform_job_finish.sas
******************************************************************/

%macro etl_job_finish;
   /* Продолжаем модуль */
   %job_continue(mpJobType=JOB, mpPostEvent=N);

   /* Завершаем модуль */
   %job_finish(mpJobType=JOB);
%mend etl_job_finish;
