/*****************************************************************
*  ВЕРСИЯ:
*     $Id: ff6f51b2f727dc501447cc950bfe695a2f826a06 $
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Проверяет наличие ошибок на текущем уровне процессов.
*     Если они есть, останавливает исполнение.
*     Если нет, отмечает точку перезапуска (checkpoint).
*
*  ПАРАМЕТРЫ:
*     mpCheckpointName        +  имя точки перезапуска
*
******************************************************************
*  Использует:
*     ETL_MODULE_RC
*     %etl_job_start
*     %job_event_reg
*
*  Устанавливает макропеременные:
*     нет
*
******************************************************************
*  Пример использования:
*     В трансформации transform_checkpoint.sas
*
******************************************************************
*  23-07-2014  Нестерёнок     Начальное кодирование
******************************************************************/

%macro etl_checkpoint (
   mpCheckpointName           =
);
   /* Если в текущей сессии были ошибки, то аварийно выходим */
   %if (&ETL_MODULE_RC ne 0) %then %do;
      %job_event_reg (
         mpEventTypeCode  =  CHECKPOINT_FAILED,
         mpEventValues    =  %bquote(ETL_MODULE_RC=&ETL_MODULE_RC)
      );
      %return;
   %end;

   /* Иначе создаем точку перезапуска */
   %job_event_reg (
      mpEventTypeCode  =  CHECKPOINT_SET,
      mpEventValues    =  %bquote(&mpCheckpointName)
   );

   &mpCheckpointName:

   /* И открываем модуль */
   %etl_job_start;
%mend etl_checkpoint;
