/*****************************************************************
* ВЕРСИЯ:
*   $Id: bec3fd718eaa50d19ba2a8c4dc431b77ebfa0365 $
*
******************************************************************
* НАЗНАЧЕНИЕ:
*   Вызывает макрос rcSet (обычно генерируется DIS), если он был объявлен.
*   В противном случае ничего не делает.
*
* ПАРАМЕТРЫ:
*   mpRc                   + код, который передается в rcSet
*
******************************************************************
* Пример использования:
*     %error_check (mpStepType=SQL_PASS_THROUGH);
*     %etl_rcSet(&STEP_RC);
*
******************************************************************
* 28-08-2012   Нестерёнок  Начальное кодирование
******************************************************************/

%macro etl_rcSet (mpRc);
   %if %sysmacexist(rcSet) %then
      %rcSet(&mpRc);
%mend etl_rcSet;

