/*****************************************************************
*  ВЕРСИЯ:
*     $Id: f1f48ed81bd08d28a7246164317166a4c7cb4243 $
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Регистрирует конец потока ETL.
*
*  ПАРАМЕТРЫ:
*     нет
*
******************************************************************
*  Использует:
*     %job_continue
*     %job_finish
*
*  Устанавливает макропеременные:
*     нет
*
******************************************************************
*  Пример использования:
*     %etl_stream_finish;
*
******************************************************************
*  22-12-2014  Нестерёнок     Вынесено из трансформации transform_stream_finish.sas
******************************************************************/

%macro etl_stream_finish (
);
   /* Продолжаем поток */
   %job_continue(mpJobType=STREAM, mpPostEvent=N);

   /* Завершаем поток */
   %job_finish(mpJobType=STREAM);
%mend etl_stream_finish;
