/*****************************************************************
*  ВЕРСИЯ:
*     $Id: 01e471ea8e9eb784265061f437b82b5df3228c55 $
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Мягко завершает процесс.  Служит для аварийного останова.
*     Работает в глобальном режиме или внутри DATA STEP.
*
*  ПАРАМЕТРЫ:
*     нет
*
******************************************************************
*  Использует:
*     нет
*
*  Устанавливает макропеременные:
*     нет
*
*  Ограничения:
*     1. Если вызвана внутри STP, ничего не делает.
*
******************************************************************
*  Пример использования:
*     data ...
*        if x = "ABC" then do;
*           %etl_stop;
*        end;
*
******************************************************************
*  06-06-2012  Нестерёнок     Начальное кодирование
*  15-04-2014  Нестерёнок     Добавлен режим внутри DATA STEP
*  20-04-2018  Нестерёнок     Добавлена проверка на STP
******************************************************************/

%macro etl_stop;
   /* Проверка, что не STP */
   %if %symglobl(_PROGRAM) %then %return;

   /* Проверка среды */
   %local lmvIsDataStep;
   %let lmvIsDataStep = %eval (&SYSPROCNAME eq DATASTEP);

   %if not &lmvIsDataStep %then %do;
      data _null_;
   %end;
         abort cancel;
   %if not &lmvIsDataStep %then %do;
      run;
   %end;
%mend etl_stop;
