/*****************************************************************
*  ВЕРСИЯ:
*     $Id:  $
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Очистка таблиц ETL_SYS
*     
*
*  ПАРАМЕТРЫ:
*
******************************************************************
*  Использует:
*     %postgres_connect
*
*  Устанавливает макропеременные:
*     нет
*
*  Ограничения:
*     нет
*
******************************************************************
*  ПРИМЕР ИСПОЛЬЗОВАНИЯ:
*     %truncate_etl_sys;
*
******************************************************************
*  16-04-2020  Зотиков     Начальное кодирование
******************************************************************/
%macro truncate_etl_sys;
	
	proc sql;
		%postgres_connect (mpLoginSet=ETL_SYS);
			execute      
				(truncate table etl_sys.etl_resource_registry_attr;
				truncate table etl_sys.etl_resource_registry cascade;
				) 
				by postgres;  
		disconnect from postgres;
	quit;


%mend truncate_etl_sys;