/*****************************************************************
*  ВЕРСИЯ:
*     $Id: $
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Поток проверки статусов
*
******************************************************************
*  20-04-2020  Зотиков     Начальное кодирование
******************************************************************/
%etl_stream_start;

%include "/opt/sas/mcd_config/config/initialize_global.sas"; 

data work.privet_table;
	set sashelp.cars;
run;

%let privet = %sysfunc(sleep(60,1));

%etl_stream_finish;