/*****************************************************************
*  ВЕРСИЯ:
*     $Id: d2a281d9cd1865a633b92c096b8e45c2c8c0acc2 $
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Открывает блокировку таблицы, с ожиданием или без него.
*     Может вызываться только внутри транзакции.
*
*  ПАРАМЕТРЫ:
*     mpTable                 +  имя таблицы в DB2
*     mpLockMode              +  режим блокировки
*     mpWait                  -  для совместимости с oracle_table_lock
*     mpConnection            -  имя подключения, в контексте которого открыта транзакция
*                                по умолчанию db2
*
******************************************************************
*  Пример использования:
*     %etl_transaction_start (mpLoginSet=ETL_IA);
*     %db2_table_lock (mpTable=COUNTERPARTY_BK_RK, mpLockMode=EXCLUSIVE, mpWait=INF);
*     execute by db2 (
*       ...
*
******************************************************************
*  06-06-2014  Нестерёнок     Начальное кодирование
******************************************************************/

%macro db2_table_lock (
   mpTable                 =  ,
   mpLockMode              =  ,
   mpWait                  =  ,
   mpConnection            =  db2
);
   execute (
      lock table &mpTable
         in &mpLockMode mode
   ) by &mpConnection;
%mend db2_table_lock;
