/*****************************************************************
*  ВЕРСИЯ:
*     $Id:  $
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Очистка таблиц в PG
*     
*
*  ПАРАМЕТРЫ:
*
******************************************************************
*  Использует:
*     %postgres_connect
*
*  Устанавливает макропеременные:
*     нет
*
*  Ограничения:
*     нет
*
******************************************************************
*  ПРИМЕР ИСПОЛЬЗОВАНИЯ:
*     %m000_000_truncate_all;
*
******************************************************************
*  16-04-2020  Зотиков     Начальное кодирование
******************************************************************/
%macro m000_000_truncate_all;
	
	%truncate_etl_stg;
	%truncate_etl_ia;

%mend m000_000_truncate_all;