/*****************************************************************
*  ВЕРСИЯ:
*     $Id: 
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Макрос для загрузки данных в рамках сквозного процесса для оперпрогноза (мастеркоды)
*	
*
*  ПАРАМЕТРЫ:
*     Нет
*
******************************************************************
*  Использует: 
*	  нет
*
*  Устанавливает макропеременные:
*     нет
*
******************************************************************
*  Пример использования:
*     %rtp000_002_load_data_mcode;
*
****************************************************************************
*  21-07-2020  Борзунов     Начальное кодирование
****************************************************************************/
%macro rtp000_002_load_data_mcode;

	%let etls_jobName=rtp000_002_load_data_mcode;
	%etl_job_start;
	
	/* 1. загрузка данных в CAS */
	%rtp_2_load_data_mastercode( mpMode=A,
							mpInputTableScore=casuser.all_ml_scoring, 
							mpInputTableTrain=casuser.all_ml_train,
							mpOutputTableScore = casuser.master_code_score,
							mpOutputTableTrain = casuser.master_code_train
							);
	
	%etl_job_finish;
	
%mend rtp000_002_load_data_mcode;