/*****************************************************************
*  ВЕРСИЯ:
*     $Id: 
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Макрос для подготовки данных в рамках сквозного процесса для оперпрогноза (продукты)
*	
*
*  ПАРАМЕТРЫ:
*     Нет
*
******************************************************************
*  Использует: 
*	  нет
*
*  Устанавливает макропеременные:
*     нет
*
******************************************************************
*  Пример использования:
*     %rtp000_001_load_data_product;
*
****************************************************************************
*  21-07-2020  Борзунов     Начальное кодирование
****************************************************************************/
%macro rtp000_001_load_data_product;

	%let etls_jobName=rtp000_001_load_data_product;
	%etl_job_start;
	
	/* 1. загрузка данных в CAS */
	%rtp_1_load_data_product(mpMode=A,
					 mpOutTrain=casuser.all_ml_train,
					 mpOutScore=casuser.all_ml_scoring);
	
	%etl_job_finish;
	
%mend rtp000_001_load_data_product;