/*****************************************************************
*  ВЕРСИЯ:
*     $Id: 
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Макрос для подготовки данных в рамках сквозного процесса для оперпрогноза (pbo)
*	
*
*  ПАРАМЕТРЫ:
*     Нет
*
******************************************************************
*  Использует: 
*	  нет
*
*  Устанавливает макропеременные:
*     нет
*
******************************************************************
*  Пример использования:
*     %rtp000_003_load_data_pbo;
*
****************************************************************************
*  21-07-2020  Борзунов     Начальное кодирование
****************************************************************************/
%macro rtp000_003_load_data_pbo;

	%let etls_jobName=rtp000_003_load_data_pbo;
	%etl_job_start;
	
	/* 1. загрузка данных в CAS */
	%rtp_3_load_data_pbo(mpMode=A, 
							mpOutTableTrain=casuser.pbo_train,
							mpOutTableScore=casuser.pbo_score);
	
	%etl_job_finish;
	
%mend rtp000_003_load_data_pbo;