/*****************************************************************
*  ВЕРСИЯ:
*     $Id: 
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Макрос для запуска VF-проекта на основе pmix_sal_abt
*	
*
*  ПАРАМЕТРЫ:
*     Нет
*
******************************************************************
*  Использует: 
*	  нет
*
*  Устанавливает макропеременные:
*     нет
*
******************************************************************
*  Пример использования:
*     %vf000_005_run_project_pmix;
*
****************************************************************************
*  21-07-2020  Борзунов     Начальное кодирование
****************************************************************************/
%macro vf000_005_run_project_pmix;

	%let etls_jobName=vf000_005_run_project_pmix;
	%etl_job_start;
	
	/* Запуск VF-проекта на основе pmix_sal_abt*/
	%vf_run_project(mpProjectId=&VF_PMIX_ID.);  
	
	%etl_job_finish;
	
%mend vf000_005_run_project_pmix;