/*****************************************************************
*  ВЕРСИЯ:
*     $Id: 
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Макрос для загрузки данных в CAS в рамках 
*	  сквозного процесса прогнозирования временными рядами
*	
*
*  ПАРАМЕТРЫ:
*     Нет
*
******************************************************************
*  Использует: 
*	  нет
*
*  Устанавливает макропеременные:
*     нет
*
******************************************************************
*  Пример использования:
*     %vf000_001_load_data;
*
****************************************************************************
*  21-07-2020  Борзунов     Начальное кодирование
****************************************************************************/
%macro vf000_001_load_data;

	%let etls_jobName=vf000_001_load_data;
	%etl_job_start;
	
	/* 1. загрузка данных в CAS */
	%vf_load_data(mpEvents=dm_abt.events,mpEventsMkup=dm_abt.events_mkup);
	
	%etl_job_finish;
	
%mend vf000_001_load_data;