/*****************************************************************
*  ВЕРСИЯ:
*     $Id: 
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Макрос для запуска VF-проекта на основе pbo_sal_abt
*	
*
*  ПАРАМЕТРЫ:
*     Нет
*
******************************************************************
*  Использует: 
*	  нет
*
*  Устанавливает макропеременные:
*     нет
*
******************************************************************
*  Пример использования:
*     %vf000_003_run_project_pbo;
*
****************************************************************************
*  21-07-2020  Борзунов     Начальное кодирование
****************************************************************************/
%macro vf000_003_run_project_pbo;

	%let etls_jobName=vf000_003_run_project_pbo;
	%etl_job_start;
	
	/*3. Запуск VF-проекта на основе pbo_sal_abt*/
	%vf_run_project(mpProjectId=&VF_PBO_ID.);   
	
	%etl_job_finish;
	
%mend vf000_003_run_project_pbo;