/*****************************************************************
*  ВЕРСИЯ:
*     $Id: 
*
******************************************************************
*  НАЗНАЧЕНИЕ:
*     Макрос для создания модели недельного профиля для 
*	  разбивки GC по дням и переагрегации недель до месяцев
*	
*
*  ПАРАМЕТРЫ:
*     Нет
*
******************************************************************
*  Использует: 
*	  нет
*
*  Устанавливает макропеременные:
*     нет
*
******************************************************************
*  Пример использования:
*     %vf100_002_week_profile_gc;
*
****************************************************************************
*  21-07-2020  Борзунов     Начальное кодирование
****************************************************************************/
%macro vf100_002_week_profile_gc;

	%let etls_jobName=vf100_002_week_profile_gc;
	%etl_job_start;
	
	/* Создание модели недельного профиля для разбивки GC по дням и переагрегации недель до месяцев*/
	%vf_train_week_profile_gc(mpInEventsMkup=dm_abt.events_mkup,
									 mpNnetWp=casuser.nnet_wp1,
									 mpPromo_W=casuser.promo_w 
									 );
	
	%etl_job_finish;
	
%mend vf100_002_week_profile_gc;