/*****************************************************************
*  НАЗНАЧЕНИЕ:
*     Создает предикат равенства для строки в Oracle.
*
*  ПАРАМЕТРЫ:
*     mpText           + строка
*
******************************************************************
*  Использует:
*     %oracle_string
*
*  Устанавливает макропеременные:
*     нет
*
******************************************************************
*  Пример использования:
      execute (
         update ...
         where
            job_nm %oracle_eq_string(&myName)
*
******************************************************************
* 05-07-2012   Нестерёнок  Начальное кодирование
******************************************************************/

%macro oracle_eq_string(
   mpText
);
  %if %is_blank(mpText) %then %do;
     IS NULL
  %end;
  %else %do;
     = %oracle_string(&mpText)
  %end;
%mend oracle_eq_string;