/*****************************************************************
* НАЗНАЧЕНИЕ:
*   Создает предикат равенства для строки в Postgres.
*
* ПАРАМЕТРЫ:
*   mpText           + строка
*
******************************************************************
* ИСПОЛЬЗУЕТ:
*     %postgres_string
*
* УСТАНАВЛИВАЕТ МАКРОПЕРЕМЕННЫЕ:
*     нет
*
******************************************************************
* ПРИМЕР ИСПОЛЬЗОВАНИЯ:
      execute (
         update ...
         where
            job_id %postgres_eq_string(&myId)
*
******************************************************************
* 31-03-2017   Задояный  Начальное кодирование
******************************************************************/

%macro postgres_eq_string(mpText);
  %if %is_blank(mpText) %then %do;
     IS NULL
  %end;
  %else %do;
     = %postgres_string(&mpText)
  %end;
%mend postgres_eq_string;